<!-- add-pr-comment:github_plan -->

# production/github Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_iam_policy.notification_admin_build_push will be created
  + resource "aws_iam_policy" "notification_admin_build_push" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "notification-admin-build-push"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchDeleteImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/admin"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_policy.notification_api_build_push will be created
  + resource "aws_iam_policy" "notification_api_build_push" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "notification-api-build-push"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchDeleteImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api-lambda",
                          + "arn:aws:ecr:ca-central-1:296255494825:repository/notify/api",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_policy.notification_document_download_build_push will be created
  + resource "aws_iam_policy" "notification_document_download_build_push" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "notification-document-download-build-push"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ecr:GetAuthorizationToken"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ecr:UploadLayerPart",
                          + "ecr:PutImage",
                          + "ecr:ListImages",
                          + "ecr:InitiateLayerUpload",
                          + "ecr:DescribeImages",
                          + "ecr:CompleteLayerUpload",
                          + "ecr:BatchDeleteImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ecr:ca-central-1:296255494825:repository/notify/document-download"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_role_policy_attachment.notification_admin_build_push_dev_branch will be created
  + resource "aws_iam_role_policy_attachment" "notification_admin_build_push_dev_branch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-admin-build-push-dev-branch"
    }
  # aws_iam_role_policy_attachment.notification_admin_build_push_dev_branch_oidc_plan_policy will be created
  + resource "aws_iam_role_policy_attachment" "notification_admin_build_push_dev_branch_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/OIDCPlanPolicy"
      + role       = "notification-admin-build-push-dev-branch"
    }
  # aws_iam_role_policy_attachment.notification_admin_build_push_dev_branch_read_only will be created
  + resource "aws_iam_role_policy_attachment" "notification_admin_build_push_dev_branch_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-admin-build-push-dev-branch"
    }
  # aws_iam_role_policy_attachment.notification_admin_build_push_main_branch will be created
  + resource "aws_iam_role_policy_attachment" "notification_admin_build_push_main_branch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-admin-build-push-main-branch"
    }
  # aws_iam_role_policy_attachment.notification_admin_build_push_main_branch_oidc_plan_policy will be created
  + resource "aws_iam_role_policy_attachment" "notification_admin_build_push_main_branch_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/OIDCPlanPolicy"
      + role       = "notification-admin-build-push-main-branch"
    }
  # aws_iam_role_policy_attachment.notification_admin_build_push_main_branch_read_only will be created
  + resource "aws_iam_role_policy_attachment" "notification_admin_build_push_main_branch_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-admin-build-push-main-branch"
    }
  # aws_iam_role_policy_attachment.notification_api_build_push_dev_branch will be created
  + resource "aws_iam_role_policy_attachment" "notification_api_build_push_dev_branch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-api-build-push-dev-branch"
    }
  # aws_iam_role_policy_attachment.notification_api_build_push_dev_branch_oidc_plan_policy will be created
  + resource "aws_iam_role_policy_attachment" "notification_api_build_push_dev_branch_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/OIDCPlanPolicy"
      + role       = "notification-api-build-push-dev-branch"
    }
  # aws_iam_role_policy_attachment.notification_api_build_push_dev_branch_read_only will be created
  + resource "aws_iam_role_policy_attachment" "notification_api_build_push_dev_branch_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-api-build-push-dev-branch"
    }
  # aws_iam_role_policy_attachment.notification_api_build_push_main_branch will be created
  + resource "aws_iam_role_policy_attachment" "notification_api_build_push_main_branch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-api-build-push-main-branch"
    }
  # aws_iam_role_policy_attachment.notification_api_build_push_main_branch_oidc_plan_policy will be created
  + resource "aws_iam_role_policy_attachment" "notification_api_build_push_main_branch_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/OIDCPlanPolicy"
      + role       = "notification-api-build-push-main-branch"
    }
  # aws_iam_role_policy_attachment.notification_api_build_push_main_branch_read_only will be created
  + resource "aws_iam_role_policy_attachment" "notification_api_build_push_main_branch_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-api-build-push-main-branch"
    }
  # aws_iam_role_policy_attachment.notification_document_download_build_push_dev_branch will be created
  + resource "aws_iam_role_policy_attachment" "notification_document_download_build_push_dev_branch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-document-download-build-push-dev-branch"
    }
  # aws_iam_role_policy_attachment.notification_document_download_build_push_dev_branch_oidc_plan_policy will be created
  + resource "aws_iam_role_policy_attachment" "notification_document_download_build_push_dev_branch_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/OIDCPlanPolicy"
      + role       = "notification-document-download-build-push-dev-branch"
    }
  # aws_iam_role_policy_attachment.notification_document_download_build_push_dev_branch_read_only will be created
  + resource "aws_iam_role_policy_attachment" "notification_document_download_build_push_dev_branch_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-document-download-build-push-dev-branch"
    }
  # aws_iam_role_policy_attachment.notification_document_download_build_push_main_branch will be created
  + resource "aws_iam_role_policy_attachment" "notification_document_download_build_push_main_branch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-document-download-build-push-main-branch"
    }
  # aws_iam_role_policy_attachment.notification_document_download_build_push_main_branch_oidc_plan_policy will be created
  + resource "aws_iam_role_policy_attachment" "notification_document_download_build_push_main_branch_oidc_plan_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/OIDCPlanPolicy"
      + role       = "notification-document-download-build-push-main-branch"
    }
  # aws_iam_role_policy_attachment.notification_document_download_build_push_main_branch_read_only will be created
  + resource "aws_iam_role_policy_attachment" "notification_document_download_build_push_main_branch_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "notification-document-download-build-push-main-branch"
    }
  # module.github_workflow_roles_notification_admin.aws_iam_role.this["notification-admin-build-push-dev-branch"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-admin:ref:refs/heads/dev"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-admin-build-push-dev-branch"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.github_workflow_roles_notification_admin.aws_iam_role.this["notification-admin-build-push-main-branch"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-admin:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-admin-build-push-main-branch"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.github_workflow_roles_notification_api.aws_iam_role.this["notification-api-build-push-dev-branch"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-api:ref:refs/heads/dev"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-api-build-push-dev-branch"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.github_workflow_roles_notification_api.aws_iam_role.this["notification-api-build-push-main-branch"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-api:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-api-build-push-main-branch"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.github_workflow_roles_notification_document_download.aws_iam_role.this["notification-document-download-build-push-dev-branch"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-document-download:ref:refs/heads/dev"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-document-download-build-push-dev-branch"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # module.github_workflow_roles_notification_document_download.aws_iam_role.this["notification-document-download-build-push-main-branch"] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:cds-snc/notification-document-download:ref:refs/heads/main"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-document-download-build-push-main-branch"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "notification-canada-ca-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
Plan: 27 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---

```